Revit 2027 API
IFCFile.CreateHeaderInstance Method
 Creates an IFC header instance in the file model.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCAnyHandle CreateHeaderInstance(
	string name
)
Public Function CreateHeaderInstance (
	name As String
) As IFCAnyHandle
public:
IFCAnyHandle^ CreateHeaderInstance(
	String^ name
)
member CreateHeaderInstance :
        name : string -> IFCAnyHandle
Parameters
name String
 The instance name.
Return Value
IFCAnyHandle
 The instance handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 file_schema, file_description and file_name must be created to get IFC file written successfully. Otherwise, the output IFC file would be empty.
See Also
Reference
IFCFile Class
Autodesk.Revit.DB.IFC Namespace